{

    "Header.Item1" : "About me",
    "Header.Item2" : "Experience",
    "Header.Item3" : "Projects",
    "Header.Item4" : "Contact",
    "Header.cvBtn" : "Resume",
    "Header.cvName": "Cv_Gabriel_Sosa_ENG.pdf",

    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "I have <span class='underline'>6 years of experience</span> developing systems, interfaces, bots, and technological solutions to make the web a better place. I dedicate myself to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> and on the backend in <span class='underline'>Java SpringBoot</span> applying good practices and development standards.",
    "Banner.ActionBtn": "Get in touch",

    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        "In my <span class='underline'>6 years as a developer</span> I seek to train myself every day. At the same time, I have worked writing <span class='underline'>unit tests</span>, performing <span class='underline'>continuous integration</span> and I specialize in backend developer roles with <span class='underline'>Java with SpringBoot and SQL Server</span>. I have also led teams having empathy, motivating colleagues, and setting plans and goals together.",
        "My capabilities also include implementing improvements in systems, optimizing sites, standardizing patterns, and suggesting and executing ideas that add value to the project I am working on.",
        "Some of the technologies in which I have trained and worked include (but are not limited to):"
    ],




    "Experience.Title": "Experience",
    "Experience.Jobs": [
      {
            "Tab": "Stefanini",
            "Title": "Fullstack developer",
            "Date": "February 2023 - Present",
            "Description": [
              "Development as a consultant at the agricultural bank in El Salvador, where apps are deployed in CI/CD through Azure devops, creation of Microservices in Java 17.",
              "Analysis in Azure Insights where presentations are generated to identify errors in the APIs and improve performance.",
              "Implementation of project using Agile methodology such as Scrum in Azure devops",
              "Unit tests with Junit and Mockito for Java 17 in SonarQube and resolution of vulnerabilities in Prisma Cloud.",
              "Development of interfaces in Angular 17 with unit tests.",
              "Development of LogicApps, Services Bus in Azure devops projects."
            ]
      },
      {
        "Tab": "Banco FICENSA",
        "Title": "Senior Programmer Analyst",
        "Date": "December 2020 - February 2023",
        "Description": [
          "Developments of new modules leading them from their implementation to conclusion in the Autobanks system.",
          "Creation of software products that helped improve internal processes.",
          "Implementation of ETLs, Store procedures and log analysis in the applications.",
          "Communications with the different bank providers with the aim of implementing new products.",
          "Technologies applied in the bank's developments are the following technologies: Java 8, Angular, Docker, Jenkins, DB2, RPG ILE.",
          "Implementation of new technological tools. Implementing a CI/CD in the bank's developments."
        ]
      },
      {
        "Tab": "INFATLAN",
        "Title": "Programmer",
        "Date": "January 2019 - December 2020",
        "Description": [
          "Maintenance to the Business Banking where it helped to monitor and resolve problems.",
          "Migration of the IBS core Bank to SAP, Where microservices were made in Docker and Kubernetes with Openshift which was the communication between SAP and the different bank channels.",
          "Implementation of technologies such as: Java SpringBoot, Genexus 16, RPGE ILE, SAP Hanna, Db2, RPGE ILE, Docker, Kubernetes.",
          "A microservices architecture was implemented, the applications in containers and managed by Kubernetes.",
          "Writing of weekly reports about goals and plans.",
          "Migration of the entire Jteller box that communicated with RPG programs to a new architecture in Java.",
          "Implementation of new architecture deployed on a Node JS server."
        ]
      },
      {
        "Tab": "HLG",
        "Title": "System Engineer",
        "Date": "April 2018 - January 2019",
        "Description": [
          "Creation of web system, user module, for consultation of local actors and search in dynamic tables.",
          "Creation of forms with ODK Collect, for the collection of information from the different municipalities in Honduras.",
          "Administration of the SQL SERVER database.",
          "Creation of Technical Assistance application in PHP with Laravel.",
          "Reports or views of the requested information from the event database, designed in Tableau.",
          "Administration of Windows Server Active Directory servers.",
          "Training of municipal staff in data collection tools.",
          "Creation of MS Excel applications using macros.",
          "Creation of web application server."
        ]
      }
    ],

    "FeatureProjects.Title": "My projects",
    "FeatureProjects.Label": "Gibson Project",
    "FeatureProjects.Projects": [{
            "Title": "Gibson",
            "Description": "Application for vehicle appraisal built from scratch with an auth module, <span class='underline'>dynamic reports</span>, <span class='underline'>configurable vehicles</span>, and <span class='underline'>user management</span>. It also has reactive form logic for parameter configuration.",
            "imgs": [
                "assets/images/gibson/gibson1.png",
                "assets/images/gibson/gibson2.png",
                "assets/images/gibson/gibson3.png",
                "assets/images/gibson/gibson4.png",
                "assets/images/gibson/gibson5.png",
                "assets/images/gibson/gibson6.png",
                "assets/images/gibson/gibson7.png",
                "assets/images/gibson/gibson8.png"
            ],
            "Technologies": ["React", "Bootstrap", "SASS", "Typescript", "NodeJs"]
        }
    ],

    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
    "Contact.Btn": "Say Hello"


}
