{

    "Header.Item1": "Acerca de mi",
    "Header.Item2": "Experiencia",
    "Header.Item3": "Proyectos",
    "Header.Item4": "Contacto",
    "Header.cvBtn": "Curriculum",
    "Header.cvName": "Cv_Gabriel_Sosa_ES.pdf",

    "Banner.Pretitle": "Hola! Mi nombre es",
    "Banner.Description": "Tengo <span class='underline'>6 años de experiencia</span> desarrollando sistemas, interfaces, bots y soluciones tecnológicas para hacer de la web un lugar mejor. Me dedico a escribir y refactorizar código limpio, reutilizable y escalable en <span class='underline'>Angular</span> y de parte del backend en <span class='underline'>Java SpringBoot</span> aplicando buenas practicas y estandares de desarrollo.",
    "Banner.ActionBtn": "Saludame",

    "AboutMe.Title": "Acerca de mi",
    "AboutMe.Paragraphs": [
        "En mis <span class='underline'>6 años como desarrollador</span> busco capacitarme cada día. Al mismo tiempo he trabajado escribiendo <span class='underline'>pruebas unitarias</span>, realizando <span class='underline'>integración continua</span> y me especializo en roles de backend developer con <span class='underline'>Java con SpringBoot y SQL Server</span>. También he liderado equipos teniendo empatía, ejerciendo motivación a compañeros y estableciendo planes y metas en conjunto.",
        "Mis capacidades también incluyen implementar mejoras en sistemas, optimizar sitios, estandarizar patrones y sugerir y ejecutar ideas que añadan valor al proyecto en el que este trabajando.",
        "Algunas de las tecnologías en las que me he capacitado y trabajado incluyen (pero no se limitan) a:"
    ],


    "Experience.Title": "Experiencia",
    "Experience.Jobs": [
      {
            "Tab": "Stefanini",
            "Title": "Fullstack developer",
            "Date": "Febrero 2023 - Actualidad",
            "Description": [
              "Desarrollo como consultor en el banco agrícola en El Salvador, donde se despliegan las apps en CI/CD mediante Azure devops, creación de Microservicios en java 17.",
              "Análisis en Azure de Insigths donde se genera presentaciones de manera de identificar los errores en las APIs y mejorar el preformance.",
              "Implementación de proyecto mediante metodología Agile como ser Scrum en Azure devops",
              "Pruebas unitarias con junit y mockito para Java 17 en SonarQube y resolución de vulnerabilidades en prisma cloud.",
              "Desarrollo de interfaces en Angular 17 con pruebas unitarias.",
              "Desarrollo de LogicApps, Services Bus en los proyectos de Azure devops."
            ]
      },
      {
        "Tab": "Banco FICENSA",
        "Title": "Analista programador Senior",
        "Date": "Diciembre 2020 - Febrero 2023",
        "Description": [
          "Desarrollos de nuevos módulos liderándolos desde su implementación hasta la conclusión en el sistema de Autobancos.",
          "Creación de productos de software que ayudaban a la mejora de procesos internos.",
          "Implementación de ETLs, Store procedures y análisis de logs en los aplicativos.",
          "Comunicaciones con los diferentes proveedores del banco con el objetivo de implementar nuevos productos.",
          "Tecnologías aplicadas en los desarrollos del banco son las siguientes tecnologías: Java 8, Angular, Docker, Jenkis, DB2, RPG ILE.",
          "Implementación de nuevas herramientas tecnológicas. Implementando en el banco una CI/CD en los desarrollos."
        ]
      },
      {
        "Tab": "INFATLAN",
        "Title": "Programador",
        "Date": "Enero 2019 - Diciembre 2020",
        "Description": [
          "Mantenimiento a la Banca empresarial donde se ayudaba al monitoreo y resolución de problemas.",
          "Migración del core Bancario de IBS a SAP, Donde se realizaron microservicios en Docker y Kubernetes con Openshift que era la comunicación entre SAP y los diferentes canales del banco.",
          "Implementación de tecnologías como: Java SpringBoot, Genexus 16, RPGE ILE, SAP Hanna, Db2, RPGE ILE, Docker, Kubernetes.",
          "Se implemento una arquitectura de microservicios, las aplicaciones en contenedores y administradas por kuberneters.",
          "Redacción de informes semanales acerca de metas y planes.",
          "Migración de toda la caja Jteller que se comunicaba con programas RPG a una nueva arquitectura en Java.",
          "Implementación de nueva arquitecura desplegada en un servidor Node JS."
        ]
      },
      {
        "Tab": "HLG",
        "Title": "System Engineer",
        "Date": "Abril 2018 - Enero 2019",
        "Description": [
          "Creación de sistema web, módulo de usuarios, para consulta de los actores locales y búsqueda en tablas dinámicas.",
          "Creación de formularios con ODK Collect, para la recolección de información de las diferentes municipalidades en Honduras.",
          "Administración de la base de datos SQL SERVER.",
          "Creación de aplicación de asistencia Técnica en PHP con Laravel.",
          "Reportes o vistas de la información solicitada de la base de datos de eventos, diseñados en Tableu.",
          "Administración de servidores Windows Server Active Directory.",
          "Capacitación al personal de las muncipalidades en herramientas de recolección de datos.",
          "Creación de aplicaciones de MS Excel utilizando macros.",
          "Creación de servidor de aplicaciones web."
        ]
      }
    ],

    "FeatureProjects.Title": "Mis proyectos",
    "FeatureProjects.Label": "Proyecto Gibson",
    "FeatureProjects.Projects": [{
            "Title": "Gibson",
            "Description": "Aplicación para el avaluo de vehiculos realizada desde cero con módulo de auth, <span class='underline'>reportes dinámicos</span>, <span class='underline'>vehículos configurables</span> y <span class='underline'>gestión de usuarios</span>. Cuenta también con lógica de formularios reactivos para la configuración de parámetros.",
            "imgs": [
                "assets/images/gibson/gibson1.png",
                "assets/images/gibson/gibson2.png",
                "assets/images/gibson/gibson3.png",
                "assets/images/gibson/gibson4.png",
                "assets/images/gibson/gibson5.png",
                "assets/images/gibson/gibson6.png",
                "assets/images/gibson/gibson7.png",
                "assets/images/gibson/gibson8.png"
            ],
            "Technologies": ["React", "Bootstrap", "SASS", "Typescript", "NodeJs"]
        }
    ],

    "Contact.Pretitle": "Y... ¿Ahora?",
    "Contact.Title": "¡Saludame!",
    "Contact.Content": "Estaré encantado de recibir tu contacto si quieres conversar acerca de nuevas oportunidades. Escríbeme, y te responderé tan pronto como vea tu mensaje.",
    "Contact.Btn": "Contactame"


}
